Revit 2024 API
BuiltInFailures.SketchFailures.StairOnlyOneConnectedBoundaryError Property
 Stairs require no less than two boundaries (chains of one or more Boundary Lines).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairOnlyOneConnectedBoundaryError { get; }
Visual Basic
Public Shared ReadOnly Property StairOnlyOneConnectedBoundaryError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairOnlyOneConnectedBoundaryError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace